# ПЛАН ПРОГРАМИ:
# 1. Підключаємо потрібні модулі.
# Згадай, які модулі потрібні: черепашки будуть робити кроки випадкової довжини.
# Напиши тут команди підключення цих модулів:

from turtle import *
from random import randint

def win(t):
   t.goto(0, 0)
   t.color("purple")
   t.write("I'M A WINNER!", font=("Arial", 20, "bold"))
   t.left(720)
   



# 2. Заводимо змінні для розміру ігрового поля,
# Так буде простіше управляти черепашками!
# Напиши команди, що задають значення ширини (width) та висоти (height) поля:
width = 200
height = 250

# 3. Створюємо об'єкти типу "Черепашка" і запам'ятовуємо їх в змінних
# Нехай тільки дві їх буде для початку.
# Конструктор Turtle () ти використовуй.
# Тут запиши:
t1 = Turtle()
t2 = Turtle()


# 4. Тепер на старт виходять черепашки.
# Які установки їм запам'ятати?
# Яка форма, колір, де встати? І чи потрібно сліди їм залишати?
t1.color('red')
t1.shape('turtle') # форма черепашки
t1.penup()
t1.goto(-1 * width, 30)

t2.color('blue')
t2.shape('turtle')
t2.penup()
t2.goto(-1 * width, -30)



# 5. А ось і гонка!
# Тут потрібно розібратися: як рухати черепашку з випадковим кроком?
# Як довго повторювати цей рух?
t1.forward(randint(2,7))
while (t1.xcor() < width and t2.xcor() < width):
   t1.forward(randint(2,7))
   t2.forward(randint(2,7))

if t1.xcor() > t2.xcor():
   win(t1)
else:
   win(t2)





