def start_ball():
    """Функція створює нову кульку у випадковому місці вгорі"""
    ball.penup()                                   # підняти "перо", щоб не малювало лінії
    ball.goto(randint(-300,300), 180)              # ставимо кульку у випадкову позицію по x, завжди вгорі (y=180)
    ball.color(choice(colors))                     # випадковий колір кульки
    ball.pendown()                                 # опустити "перо", якщо потрібно малювати


def move_ball():
    """Функція рухає кульку вниз і перевіряє, чи не вийшла вона за нижню межу"""
    ball.forward(10)                                    # рух вперед (у нашому випадку вниз, бо heading=270)
    if ball.ycor() < -180:                         # якщо кулька дійшла до низу екрана
        start_ball()                               # запускаємо її знову зверху
    screen.ontimer(move_ball, 10) #0.01sec                 # повторюємо функцію через 100 мс (анімація)


# запускаємо гру
start_ball()    # створюємо першу кульку
move_ball()     # запускаємо її рух
