import pandas as pd
df = pd.read_csv('GooglePlayStore_wild.csv')
# Виведи інформацію про весь DataFrame, щоб дізнатися, які стовпці потребують очищення
print("👽 2.2 Загальна інформація👽")
print(df.info())


# Скільки в датасеті додатків, у яких не вказано (NaN) рейтинг (Rating)?
print("👽 2.3 Кількість порожніх значень у стовпці Rating👽")
print(len(df[pd.isnull(df['Rating'])]))
# Заміни порожнього значення ('NaN') рейтингу ('Rating') для таких програм на -1.
print("👽Заміняємо  порожні заначення рейтингу на -1 👽")
df['Rating'].fillna(-1, inplace=True)
print("Тепер кількість порожніх значень дорівнює: ", len(df[pd.isnull(df['Rating'])]))


# Визнач, яке значення розміру ('Size') зберігається в датасеті крім Кілобайтів і Мегабайтів, заміни його на -1.
# Перетвори розміри додатків ('Size') у числовий формат (float). Розмір усіх програм повинен вимірюватися в Мегабайтах.
print("👽Значення, які є в стовпчику Size\nта кількість разів, що таке значення повторюється👽")
print(df['Size'].value_counts())

# функція для конвертування кілобайтів у мегабайти та прибирання "М"
def set_size(size):
   if size[-1] == 'M':
      return float(size[:-1])
   elif size[-1] == 'k':
      return float(size[:-1]) / 1024
   return -1

df['Size'] = df['Size'].apply(set_size)

print("👽222 Значення, які є в стовпчику Size\nта кількість разів, що таке значення повторюється👽")
print(df['Size'].value_counts())

# Чому дорівнює максимальний розмір ('Size') додатків із категорії ('Category') 'TOOLS'?
print("👽 Максимальний розмір додатків категорії TOOLS 👽")
print(df[df['Category'] == 'TOOLS']['Size'].max())

#Бонусні завдання
# Заміни тип даних на цілий (int) для кількості установок ('Installs').
# У записі кількості установок ('Installs') знак "+" необхідно ігнорувати.
# Тобто. якщо в датасеті кількість установок дорівнює 1,000,000+, необхідно змінити значення на 1000000
#
# функція для прибирання зайвих символів у Installs
def set_installs(installs):
   if installs == '0':
       return 0
   return int(installs[:-1].replace(',', ''))
df['Installs'] = df['Installs'].apply(set_installs)


# Згрупуй дані за типом ('Type') та цільовою аудиторією ('Content Rating') будь-яким зручним для тебе способом,
# Порахуй середню кількість установок ('Installs') у кожній групі. Результат округлили до десятих.
# В отриманій таблиці знайди комірку з найбільшим значенням.
# До якої вікової групи та типу додатків відносяться дані з цієї комірки?

print("👽 Середня кількість установок у кожній групі 👽")
print(round(df.pivot_table(index='Content Rating', columns='Type', values='Installs', aggfunc='mean')), 1)


# Яка програма не вказує тип ('Type')? Який тип необхідно записати в залежності від ціни?
print("👽 Яка програма не вказує тип 👽")
print(df[pd.isnull(df['Type'])].iloc[0])
print("👽👽")
print(df[pd.isnull(df['Type'])])
#Щоб побачити всі стовпці замість крапки, можна застосувати iloc[0].

print("👽👽")
df['Type'].fillna('Free', inplace=True)


#Виведи інформацію про весь DataFrame, щоб переконатися, що очищення пройшло успішно
print("👽👽")
print(df.info())
