import pandas as pd

# Завантажуємо датафрейм 
df = pd.read_csv('GoogleApps.csv')
pd.set_option('display.max_columns', 20)
pd.set_option('display.width', 1000)


# Як називається додаток, розташований першим у наборі даних?
print("✨Перші додатки✨")


# До якої категорії відноситься додаток, розташований останнім у наборі даних?
print("✨Останні додатки✨")


# Скільки стовпців міститься у наборі даних?
# Дані якого типу зберігаються у кожному зі стовпців?
print("✨Загальна інформація✨")


# Вкажіть середнє арифметичне та медіану розміру додатків (Size)
# Скільки коштує найдорожчий додаток?
# *Вкажіть середнє арифметичне та медіану кількості установок програм (Installs)
print("✨Статистичні дані✨")
